/* 
    [🔒문제]
        쇼핑몰 사용자 정보를 아래 조건에 맞는 사용자만 출력
        쇼핑몰 사용자 정보 - 계정명, 비밀번호, VIP여부, 마일리지

    [📝출력]
        🚩조건 - VIP 사용자
        🚩예외 - 마일리지가 음수인 사용자는 제외한 후 다음 사용자 동작
        
        출력 정보 - "[계정명] - 마일리지" 방식으로 출력
                     [1234] - 5000
*/
// 🔑Code



/* 
    [🔒문제]
        학생 성적부 정보를 아래 조건에 맞는 사용자만 출력
        학생 성적부 정보 - 이름, 학년, 반, 점수

    [📝출력]
        🚩조건 - 3학년 2반
        🚩예외 - 학년이 1~3 이 아니거나 / 반이 1~5가 아닌 사용자를 만나면 동작 멈춤
        
        출력 정보 - "이름[학년/반] - 점수" 방식으로 출력
*/
// 🔑Code