/*
    위 동작들을 각각 함수로 활용
    ex) ShowPeople(peoples);
    ex) ShowBook(books);
    ex) ShowAnimal(aninals);
*/
/* 
    [🔒문제]
        사용자 10명 중 조건에 맞는 사용자만 출력

        사용자 정보 - 이름, 나이, 직업, 성별

    [📝출력]
        조건 - 여성, 사무직, 2-30대
                예외 - 이름이 홍길동인 남성인 경우 출력
                오류 - 성별이 없거나 나이가 20세 이하인 경우 오류 이후 동작 멈춤
*/
// 🔑Code



/* 
    [🔒문제]
        책 10권 중 조건에 맞는 책만 출력

        책 정보 - 제목, 작가, 가격, 베스트셀러 여부

    [📝출력]
        조건 - 가격 < 15,000, 베스트셀러
                예외 - 작가가 생텍쥐베리인 경우 출력
                오류 - 가격이 음수인 경우 오류 이후 동작 멈춤
*/
// 🔑Code



/* 
    [🔒문제]
        동물 10마리 중 조건에 맞는 동물만 출력

        동물 정보 - 종, 몸무게, 키, 서식지

    [📝출력]
        조건 - 서식지가 산, 바다, 강
                예외 - 강아지, 고양이 출력
                오류 - 몸무게와 키가 음수인 경우 오류 이후 동작 멈춤
*/
// 🔑Code